{
  "header": {
    "navigation": {
      "aboutMe": "About Me",
      "experience": "Experiences",
      "contact": "Contacts"
    }
  },
  "home": {
    "subtitle": "Software Developer"
  },
  "projectsAndExperiences": {
    "nossoMarSalveOsPatos": {
      "title": "Nosso Mar Salve os Patinhos",
      "description": "Game developed independently in Unity with C#. In this project, I worked as the lead developer and project manager. The game's objective is to raise awareness about environmental pollution."
    },
    "estagioPlanetEco": {
      "title": "Full Stack Developer - Planet Eco",
      "description": "I am currently working on developing microservices in Flask with Redis communication, creating REST APIs for automation and system integration. I also develop responsive web interfaces using React and TypeScript, automate data collection and processing in spreadsheets and XLSX/CSV files, and maintain desktop systems in Python. Additionally, I participate in client interactions to understand requirements and deliver technical solutions aligned with their needs."
    },
    "desenvolvedorJrJavaSmit": {
      "title": "Junior Java Developer - Smit",
      "description": "I work as a Junior Java Developer, contributing to the development of backend applications using Java and Spring."
    },
    "restaurantePs": {
      "title": "Restaurante Web",
      "description": "Project for a restaurant menu management system, developed with React.js and Firebase, allowing users to view and manage the menu intuitively. The system includes features such as adding, editing, and deleting menu items, as well as a billing system after payment, and a user-friendly interface for administrators."
    },
    "deckIfy": {
      "title": "DeckIfy",
      "description": "DeckIfy is a web platform focused on automating your studies by generating Anki FlashCards using AI. Developed with React.js and Python, it is 100% open source."
    },
    "chatBotAI": {
      "title": "ChatBot AI",
      "description": "Implementation of an intelligent chatbot in JavaScript, designed to deliver realistic and interactive conversations. It uses artificial intelligence to interpret user inputs and respond dynamically."
    },
    "ankiConvertAPI": {
      "title": "Anki Convert API",
      "description": "API that converts sets of flashcards into .apkg files compatible with Anki, facilitating the creation of study materials using spaced repetition."
    },
    "processImageAPI": {
      "title": "Image Processing API",
      "description": "Microservice developed with Flask for asynchronous image resizing. It uses Redis for caching, RabbitMQ for messaging, and PIL for processing. The application is containerized with Docker Compose, allowing easy deployment and scalability. It has two endpoints: one for sending the image and resizing it, and another for querying the stored metadata."
    },
    "authJWTAPI": {
      "title": "Auth JWT API",
      "description": "Authentication microservice that uses JWT and PostgreSQL for secure and scalable login. The API is hosted on Render along with the database, allowing easy integration into modern applications."
    },
    "artigoCientifico": {
      "title": "Scientific Article",
      "description": "Scientific article analyzing the impact of the pandemic on Airbnb's economy, using Python for data collection, filtering, and analysis."
    },
    "repository": "Github",
    "visit": "Try Here",
    "download": "Download"
  },
  "aboutMe": {
  "intro": "I am {{age}} years old and currently in the {{semester}} semester of my Computer Science degree.",
  "graduation": "I am expected to graduate in December 2026.",
  "work": "I work as a software developer with experience in Java, Spring, and SQL, as well as Node.js (Express), React, and Python.",
  "focus": "My main focus is back-end development, also contributing to architecture decisions and code quality.",
  "skills": "In my daily work, I use GitHub Actions and write automated tests with JUnit and Mockito.",
  "moreSkills": "I have knowledge of software architecture principles such as SOLID, Clean Code, and Design Patterns, along with experience in Docker, Spring Security, JPA, TypeORM, and RabbitMQ.",
  "learning": "I am committed to continuous learning, especially in Cloud Computing and software development best practices."
},


  "feedback": {
    "leaveFeedback": "Leave your Feedback",
    "sendFeedback": "Send",
    "youContactFeedback": "Leave yout contact (Optional)"
  },
  "writeHere": "Write Here",
  "progressProjects": "Now",
  "showMore": "Show More",
  "showLess": "Show Less",
  "filters": {
    "all": "All",
    "frontend": "Frontend",
    "backend": "Backend",
    "fullstack": "Fullstack",
    "data": "Data Science",
    "game": "Games",
    "recent": "Recent",
    "old": "Old"
  }
}
