{
  "header": {
    "navigation": {
      "aboutMe": "About Me",
      "experience": "Experiences",
      "contact": "Contacts"
    }
  },
  "home": {
    "subtitle": "Software Developer"
  },
  "projectsAndExperiences": {
    "nossoMarSalveOsPatos": {
      "title": "Nosso Mar Salve os Patinhos",
      "description": "Game developed independently in Unity with C#. In this project, I worked as the lead developer and project manager. The game's objective is to raise awareness about environmental pollution."
    },
    "estagioPlanetEco": {
      "title": "Software Development Internship - Planet Eco",
      "description": "Currently contributing to the maintenance and improvement of the company’s internal systems, developing new features and fixing bugs. I'm also learning to work with data analysis in Excel and Power BI, and I participate in client interactions to understand their needs and provide technical support."
    },
    "restaurantePs": {
      "title": "Restaurante Web",
      "description": "Project for a restaurant menu management system, developed with React.js and Firebase, allowing users to view and manage the menu intuitively. The system includes features such as adding, editing, and deleting menu items, as well as a billing system after payment, and a user-friendly interface for administrators."
    },
    "deckIfy": {
      "title": "DeckIfy",
      "description": "DeckIfy is a web platform focused on automating your studies by generating Anki FlashCards using AI. Developed with React.js and Python, it is 100% open source."
    },
    "chatBotAI": {
      "title": "ChatBot AI",
      "description": "Implementation of an intelligent chatbot in JavaScript, designed to deliver realistic and interactive conversations. It uses artificial intelligence to interpret user inputs and respond dynamically."
    },
    "artigoCientifico": {
      "title": "Scientific Article",
      "description": "Scientific article analyzing the impact of the pandemic on Airbnb's economy, using Python for data collection, filtering, and analysis."
    },
    "repository": "Github",
    "visit": "Try Here",
    "download": "Download"
  },
  "aboutMe": {
    "intro": "I am {{age}} years old and currently in the {{semester}} semester of my Computer Science degree.",
    "graduation": "My expected graduation date is December 2026.",
    "work": "I am currently interning in software development, working with React Native and Web using TypeScript, as well as Python for automation and desktop software development.",
    "focus": "My main focus is back-end development, with experience in frameworks such as Spring Boot and Node, and basic knowledge of Domain-Driven Design (DDD).",
    "skills": "Through academic and professional projects, I have also developed front-end skills in languages and frameworks such as JavaScript, TypeScript, and React.",
    "moreSkills": "I have knowledge of software architecture principles such as SOLID, Clean Code, and Design Patterns, and experience with Docker, Spring Security, JPA, TypeORM, and basic RabbitMQ.",
    "learning": "I am committed to continuous learning, always looking for ways to improve and optimize my code and applications."
  },

  "feedback": {
    "leaveFeedback": "Leave your Feedback",
    "sendFeedback": "Send"
  },
  "writeHere": "Write Here",
  "progressProjects": "In progress",
  "showMore": "Show More",
  "showLess": "Show Less",
  "allProjects": "All Projects",
  "frontendProjects": "Front End Projects",
  "backendProjects": "Back End Projects",
  "fullstackProjects": "Full Stack Projects"
}
