{
  "header": {
    "navigation": {
      "aboutMe": "Sobre Mim",
      "experience": "Experiências",
      "contact": "Contatos"
    }
  },
  "home": {
    "subtitle": "Desenvolvedor de Software"
  },
  "projectsAndExperiences": {
    "nossoMarSalveOsPatos": {
      "title": "Nosso Mar Salve os Patinhos",
      "description": "Jogo desenvolvido de forma autonoma na Unity com C# utilizando a Unity, neste projeto atuei programando e liderando o projeto, objetivo do jogo é conscientizar as pessoas a não poluir o meio ambiente"
    },
    "estagioPlanetEco": {
      "title": "Estágio em Desenvolvimento de Software - Planet Eco",
      "description": "Atuo no desenvolvimento de microserviços em Flask com comunicação via Redis, criando APIs REST para automação e integração de sistemas. Também desenvolvo interfaces web responsivas com React e TypeScript, automatizo coleta e processamento de dados em planilhas e arquivos XLSX/CSV, além de manter sistemas desktop em Python. Participo do contato com clientes para entender requisitos e entregar soluções técnicas alinhadas às necessidades."
    },
    "restaurantePs": {
      "title": "Restaurante Web",
      "description": "Projeto de um sistema de gerenciamento de cardapio de restaurante, desenvolvido com React.js e Firebase, que permite aos usuários visualizar e gerenciar o cardápio de forma intuitiva. O sistema inclui funcionalidades como adição, edição e exclusão de itens do cardápio, também conta com um sistema de geração de NF após o pagamento, além de uma interface amigável para os administradores."
    },
    "deckIfy": {
      "title": "DeckIfy",
      "description": "DeckIfy é uma plataforma Web que foca em automatizar seus estudos gerando FlashCards Anki com AI, desenvolvido com React.js e Python ele é 100% Open Source."
    },
    "chatBotAI": {
      "title": "ChatBot AI",
      "description": "Implementação de um chatbot inteligente em JavaScript, projetado para oferecer conversas realistas e interativas. Utiliza inteligência artificial para interpretar entradas do usuário e responder de forma dinâmica."
    },
    "ankiConvertAPI": {
      "title": "Anki Convert API",
      "description": "API que converte conjuntos de flashcards em arquivos .apkg compatíveis com o Anki, facilitando a criação de materiais de estudo usando o método de repetição espaçada."
    },
    "authJWTAPI": {
      "title": "API de Autenticação com JWT",
      "description": "Microserviço de autenticação que utiliza JWT e PostgreSQL para login seguro e escalável. A API está hospedada na Render junto com o banco de dados, permitindo fácil integração em aplicações modernas."
    },
    "processImageAPI": {
      "title": "API de Processamento de Imagens",
      "description": "Microserviço desenvolvido com Flask para redimensionamento de imagens de forma assíncrona. Utiliza Redis para cache, RabbitMQ para mensageria e PIL para processamento. A aplicação está containerizada com Docker Compose, permitindo fácil deploy e escalabilidade. Conta com dois endpoints: um para envio da imagem e redimensionamento, e outro para consulta dos metadados armazenados."
    },
    "artigoCientifico": {
      "title": "Artigo Ciêntífico",
      "description": "Artigo científico que analisa os impactos da pandemia na economia da Airbnb, utilizando Python para coleta, filtragem e análise de dados."
    },
    "repository": "Github",
    "visit": "Use Aqui",
    "download": "Baixar"
  },
  "aboutMe": {
    "intro": "Tenho {{age}} anos e estou no {{semester}} semestre da faculdade de Ciência da Computação.",
    "graduation": "Minha previsão de formação é para dezembro de 2026.",
    "work": "Atualmente, estou estagiando na área de desenvolvimento de software, atuando com React Native e Web usando TypeScript, além de Python para automação e desenvolvimento de software desktop.",
    "focus": "Meu foco principal é desenvolvimento back-end, com experiência em frameworks como Spring Boot e Node, além de conhecimento básico em Domain-Driven Design (DDD).",
    "skills": "Ao longo de projetos acadêmicos e profissionais, também desenvolvi habilidades em linguagens e frameworks front-end como JavaScript, TypeScript e React.",
    "moreSkills": "Possuo conhecimentos em princípios de arquitetura de software como SOLID, Clean Code, Design Patterns, e experiência com Docker, Spring Security, JPA, TypeORM e RabbitMQ básico.",
    "learning": "Sou comprometido com o aprendizado contínuo, sempre buscando formas de aprimorar e otimizar meus códigos e aplicações."
  },

  "feedback": {
    "leaveFeedback": "Deixe seu Feedback",
    "sendFeedback": "Enviar"
  },
  "writeHere": "Escreva Aqui",
  "progressProjects": "Em Andamento",
  "showMore": "Ver Mais",
  "showLess": "Ver Menos",
  "filters": {
    "all": "Todos",
    "frontend": "Frontend",
    "backend": "Backend",
    "fullstack": "Fullstack",
    "data": "Ciência de Dados",
    "game": "Jogos"
  }
}
