{
  "header": {
    "navigation": {
      "aboutMe": "Sobre Mim",
      "experience": "Experiências",
      "contact": "Contatos"
    }
  },
  "home": {
    "subtitle": "Desenvolvedor de Software"
  },
  "projectsAndExperiences": {
    "nossoMarSalveOsPatos": {
      "title": "Nosso Mar Salve os Patinhos",
      "description": "Jogo desenvolvido de forma autonoma na Unity com C# utilizando a Unity, neste projeto atuei programando e liderando o projeto, objetivo do jogo é conscientizar as pessoas a não poluir o meio ambiente"
    },
    "estagioPlanetEco": {
      "title": "Estagiário Full Stack - Planet Eco",
      "description": "Desenvolvimento de microserviços em Flask e APIs REST para integrações internas e externas. Uso de Redis para cache. Manutenção e evolução de sistemas Desktop em Python e otimização de queries SQL. Automação de processos com Google Apps Script integrado a APIs. Desenvolvimento de interfaces web responsivas com React e TypeScript. Criação de APIs Python para processamento de arquivos XLSX e CSV. Comunicação com clientes para levantamento de requisitos e entrega de soluções."
    },

    "desenvolvedorJrJavaSmit": {
      "title": "Desenvolvedor Java Jr - Smit",
      "description": "Atuo como desenvolvedor Java Jr, contribuindo para o desenvolvimento de aplicações backend utilizando Java e Spring."
    },
    "restaurantePs": {
      "title": "Restaurante Web",
      "description": "Projeto de um sistema de gerenciamento de cardapio de restaurante, desenvolvido com React.js e Firebase, que permite aos usuários visualizar e gerenciar o cardápio de forma intuitiva. O sistema inclui funcionalidades como adição, edição e exclusão de itens do cardápio, também conta com um sistema de geração de NF após o pagamento, além de uma interface amigável para os administradores."
    },
    "deckIfy": {
      "title": "DeckIfy",
      "description": "DeckIfy é uma plataforma Web que foca em automatizar seus estudos gerando FlashCards Anki com AI, desenvolvido com React.js e Python ele é 100% Open Source."
    },
    "chatBotAI": {
      "title": "ChatBot AI",
      "description": "Implementação de um chatbot inteligente em JavaScript, projetado para oferecer conversas realistas e interativas. Utiliza inteligência artificial para interpretar entradas do usuário e responder de forma dinâmica."
    },
    "ankiConvertAPI": {
      "title": "Anki Convert API",
      "description": "API que converte conjuntos de flashcards em arquivos .apkg compatíveis com o Anki, facilitando a criação de materiais de estudo usando o método de repetição espaçada."
    },
    "authJWTAPI": {
      "title": "API de Autenticação com JWT",
      "description": "Microserviço de autenticação que utiliza JWT e PostgreSQL para login seguro e escalável. A API está hospedada na Render junto com o banco de dados, permitindo fácil integração em aplicações modernas."
    },
    "processImageAPI": {
      "title": "API de Processamento de Imagens",
      "description": "Microserviço desenvolvido com Flask para redimensionamento de imagens de forma assíncrona. Utiliza Redis para cache, RabbitMQ para mensageria e PIL para processamento. A aplicação está containerizada com Docker Compose, permitindo fácil deploy e escalabilidade. Conta com dois endpoints: um para envio da imagem e redimensionamento, e outro para consulta dos metadados armazenados."
    },
    "artigoCientifico": {
      "title": "Artigo Ciêntífico",
      "description": "Artigo científico que analisa os impactos da pandemia na economia da Airbnb, utilizando Python para coleta, filtragem e análise de dados."
    },
    "repository": "Github",
    "visit": "Use Aqui",
    "download": "Baixar"
  },
  "aboutMe": {
    "intro": "Tenho {{age}} anos e estou no {{semester}} semestre da faculdade de Ciência da Computação.",
    "graduation": "Minha previsão de formação é para dezembro de 2026.",
    "work": "Atualmente, atuo como desenvolvedor de software com experiência em Java, Spring e SQL, além de Node.js (Express), React e Python.",
    "focus": "Meu foco principal é desenvolvimento back-end, contribuindo também em decisões de arquitetura e qualidade de código.",
    "skills": "No dia a dia, trabalho com Java, Spring e testes automatizados usando JUnit e Mockito.",
    "moreSkills": "Tenho conhecimentos em princípios de arquitetura como SOLID, Clean Code, Design Patterns e experiência com Docker, Spring Security, JPA, TypeORM e RabbitMQ.",
    "learning": "Estou em constante aprendizado, especialmente em Cloud Computing e boas práticas de desenvolvimento."
  },
  "feedback": {
    "leaveFeedback": "Deixe seu Feedback",
    "sendFeedback": "Enviar",
    "youContactFeedback": "Deixe seu contato (Opcional)"
  },
  "writeHere": "Escreva Aqui",
  "progressProjects": "Atual",
  "showMore": "Ver Mais",
  "showLess": "Ver Menos",
  "filters": {
    "all": "Todos",
    "frontend": "Frontend",
    "backend": "Backend",
    "fullstack": "Fullstack",
    "data": "Ciência de Dados",
    "game": "Jogos",
    "recent": "Recentes",
    "old": "Antigos"
  }
}
